ФитнесПроект/CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПредприятия</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПредприятия.Resource.КоличествоЧасов</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПредприятия.Dimension.День</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоказательРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

ФитнесПроект/CalculationRegisters/Начисления/Ext/RecordSetModule.bsl
Процедура РассчитатьСуммуНачисления() Экспорт 
	
	ДнейБольничногоЗаСчетРаботодателя = 3;
	
	Для Каждого Движение ИЗ ЭтотОбъект Цикл
		
		Если Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Оклад Тогда
			Оклад = Движение.ПоказательРасчета;
			ОтработаноЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия).Итог("КоличествоЧасов");
			НормаЧасов = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия).Итог("КоличествоЧасов");
			РезультатРасчета = Оклад * ОтработаноЧасов / НормаЧасов;
			Движение.Сумма = РезультатРасчета;
		ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный Тогда
			Оклад = Движение.ПоказательРасчета;
			СтоимостьДняПоБолезни = Оклад * 24 / 730;
			КоличествоДнейБолезни = (КонецДня(Движение.ПериодДействияКонец)+1 - Движение.ПериодДействияНачало)/86400;
			Если КоличествоДнейБолезни <= ДнейБольничногоЗаСчетРаботодателя Тогда
				РезультатРасчета = КоличествоДнейБолезни * СтоимостьДняПоБолезни;
				ДнейБольничногоЗаСчетРаботодателя = ДнейБольничногоЗаСчетРаботодателя - КоличествоДнейБолезни;
			Иначе 
				РезультатРасчета = ДнейБольничногоЗаСчетРаботодателя * СтоимостьДняПоБолезни;
				ДнейБольничногоЗаСчетРаботодателя = 0;
			КонецЕсли;
			Движение.Сумма = РезультатРасчета;
		ИначеЕсли Движение.ВидРасчета.Предопределенный = Ложь Тогда
			РезультатРасчета = Неопределено;
			ФормулаРасчета = Движение.ВидРасчета.ФормулаРасчета;    
			Выполнить(ФормулаРасчета);
			Движение.Сумма = РезультатРасчета;
		Иначе
			Движение.Сумма = 0;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = СтрШаблон("Для вида расчета %1 не задана формула расчета!", Движение.ВидРасчета);
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтотОбъект.Записать(,Истина);
	
КонецПроцедуры
